Tekla Open API Reference for Tekla Structures 2025
BendSurface.SideBoundary1 Property
 Gets or sets the first side boundary.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineSegment SideBoundary1 { get; set; }
Public Property SideBoundary1 As LineSegment
	Get
	Set
Property Value
Type: LineSegment
See Also
Reference
BendSurface Class
Tekla.Structures.Model Namespace